# Join Statements - Lab

## Introduction

In this lab, you'll practice your knowledge of join statements, using various types of joins and various methods for specifying the links between them.

## Objectives

You will be able to:
- Write queries that make use of various types of Joins
- Join tables using foreign keys

## CRM Schema

In almost all cases, rather then just working with a single table you will typically need data from multiple tables. 
Doing this requires the use of **joins ** using shared columns from the two tables. 

In this lab, you'll use the same Customer Relationship Management (CRM) database that you saw from the previous lesson.
<img src='images/Database-Schema.png' width="600">

## Connecting to the Database
Import the necessary packages and connect to the database **data.sqlite**.

In [2]:
#Your code here
import pandas as pd
import sqlite3

conn = sqlite3.connect('data.sqlite')
c = conn.cursor()

## Display the names of all the employees in Boston.
Hint: join the employees and offices tables.

In [6]:
#Your code here
c.execute("""SELECT firstName, lastName FROM employees 
                JOIN offices USING(officeCode)
                WHERE city IS 'Boston'""")
df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
df

  firstName   lastName
0     Julie   Firrelli
1     Steve  Patterson

## Do any offices have no employees?
Hint: Combine the employees and offices tables and use a group by.

In [23]:
#Your code here
c.execute("""SELECT COUNT(employeeNumber) FROM offices
                LEFT JOIN employees USING(officeCode)
                GROUP BY officeCode""")
df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
df

   COUNT(employeeNumber)
0                      6
1                      2
2                      2
3                      5
4                      2
5                      4
6                      2

## Write 3 Questions of your own and answer them

In [ ]:
# Answers will vary
# 1. how many customers does each office serve?

In [40]:
# Your code here
c.execute("""SELECT officeCode, o.city, COUNT(customerNumber) as customers FROM offices o
                JOIN employees e USING(officeCode)
                JOIN customers c ON e.employeeNumber = c.salesRepEmployeeNumber
                GROUP BY officeCode""")

df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
df

  officeCode           city  customers
0          1  San Francisco         12
1          2         Boston         12
2          3            NYC         15
3          4          Paris         29
4          5          Tokyo          5
5          6         Sydney         10
6          7         London         17

In [ ]:
# Your code here

In [ ]:
# Your code here

## Level Up: Display the names of each product each employee has sold

In [57]:
# Your code here
# join employees with customers, orders, orderdetails, and products
c.execute("""SELECT e.p.productName, COUNT(p.productCode) FROM employees e
                JOIN customers c ON e.employeeNumber = c.salesRepEmployeeNumber
                JOIN orders o ON c.customerNumber = o.customerNumber
                JOIN orderdetails od ON o.orderNumber = od.orderNumber
                JOIN products p ON od.productCode = p.productCode
                GROUP BY p.productCode""")
df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
df

                                     productName  COUNT(p.productCode)
0          1969 Harley Davidson Ultimate Chopper                    28
1                       1952 Alpine Renault 1300                    28
2                          1996 Moto Guzzi 1100i                    28
3           2003 Harley-Davidson Eagle Drag Bike                    28
4                            1972 Alfa Romeo GTA                    28
5                         1962 LanciaA Delta 16V                    28
6                              1968 Ford Mustang                    27
7                              2001 Ferrari Enzo                    27
8                                 1958 Setra Bus                    28
9                               2002 Suzuki XREO                    28
10                            1969 Corvair Monza                    27
11                            1968 Dodge Charger                    27
12                              1969 Ford Falcon                    27
13                       1970 Plymouth Hemi Cuda                    27
14                             1957 Chevy Pickup                    28
15                            1969 Dodge Charger                    27
16                        1940 Ford Pickup Truck                    28
17                               1993 Mazda RX-7                    27
18                          1937 Lincoln Berline                    28
19      1936 Mercedes-Benz 500K Special Roadster                    28
20                         1965 Aston Martin DB5                    25
21                   1980s Black Hawk Helicopter                    28
22                      1917 Grand Touring Sedan                    25
23                   1948 Porsche 356-A Roadster                    27
24                              1995 Honda Civic                    27
25                1998 Chrysler Plymouth Prowler                    28
26                            1911 Ford Town Car                    25
27                        1964 Mercedes Tour Bus                    28
28                     1932 Model A Ford J-Coupe                    28
29                         1926 Ford Fire Engine                    28
..                                           ...                   ...
79             1992 Porsche Cayenne Turbo Silver                    27
80                         1936 Chrysler Airflow                    28
81                       1900s Vintage Tri-Plane                    28
82                         1961 Chevrolet Impala                    27
83                   1980’s GM Manhattan Express                    28
84                              1997 BMW F650 ST                    28
85                             1982 Ducati 996 R                    27
86                   1954 Greyhound Scenicruiser                    28
87        1950's Chicago Surface Lines Streetcar                    27
88   1996 Peterbilt 379 Stake Bed with Outrigger                    28
89                      1928 Ford Phaeton Deluxe                    28
90                     1974 Ducati 350 Mk3 Desmo                    27
91                  1930 Buick Marquette Phaeton                    28
92              Diamond T620 Semi-Skirted Tanker                    28
93                1962 City of Detroit Streetcar                    27
94                            2002 Yamaha YZR M1                    27
95                         The Schooner Bluenose                    27
96                   American Airlines: B767-300                    28
97                                 The Mayflower                    27
98                                    HMS Bounty                    28
99                America West Airlines B757-200                    28
100                    The USS Constitution Ship                    27
101                              1982 Camaro Z28                    28
102                                ATA: B757-300                    28
103                           F/A 18 Hornet 1/72                    28
104                                  The Titanic                    27
105                               The Queen Mary                    27
106                    American Airlines: MD-11S                    28
107                             Boeing X-32A JSF                    28
108                                   Pont Yacht                    27

[109 rows x 2 columns]

## Level Up: Display the Number of Products each employee has sold

In [61]:
#Your code here
c.execute("""SELECT e.firstName, e.lastName, COUNT(p.productCode) as productsSold FROM employees e
                JOIN customers c ON e.employeeNumber = c.salesRepEmployeeNumber
                JOIN orders o ON c.customerNumber = o.customerNumber
                JOIN orderdetails od ON o.orderNumber = od.orderNumber
                JOIN products p ON od.productCode = p.productCode
                GROUP BY employeeNumber""")
df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
df

   firstName   lastName  productsSold
0     Leslie   Jennings           331
1     Leslie   Thompson           114
2      Julie   Firrelli           124
3      Steve  Patterson           152
4   Foon Yue      Tseng           142
5     George     Vanauf           211
6       Loui     Bondur           177
7     Gerard  Hernandez           396
8     Pamela   Castillo           272
9      Larry       Bott           236
10     Barry      Jones           220
11      Andy     Fixter           185
12     Peter      Marsh           185
13      Mami      Nishi           137
14    Martin     Gerard           114

## Summary

Congrats! You now know how to use join statements, along with leveraging your foreign keys knowledge!